In [1]:
import pandas as pd

In [2]:
countries = ['Germany', 'France', 'Indonesia']
inhabitants = [82.5 * 10**6, 66.9 * 10**6, 255.5 * 10**6]
capitals = ['Berlin', 'Paris', 'Jakarta']

df1 = pd.DataFrame({'country': countries,
                    'inhabitant': inhabitants,
                    'capital': capitals})
df1 = df1[['country', 'capital', 'inhabitant']]

In [3]:
print(df1)

     country  capital   inhabitant
0    Germany   Berlin   82500000.0
1     France    Paris   66900000.0
2  Indonesia  Jakarta  255500000.0

In [4]:
countries = ['Germany', 'Italy', 'Spain', 'Austria']
capitals = ['Berlin', 'Rome', 'Madrid', 'Vienna']
hdis = [0.926, 0.897, 0.844, 0.893]
df2 = pd.DataFrame({'country': countries,
                    'capital': capitals,
                    'HDI': hdis})
df2 = df2[['country', 'capital', 'HDI']]

In [5]:
print(df2)

   country capital    HDI
0  Germany  Berlin  0.926
1    Italy    Rome  0.897
2    Spain  Madrid  0.844
3  Austria  Vienna  0.893

In [6]:
df1.merge(df2, on='country', how='inner')

   country capital_x  inhabitant capital_y    HDI
0  Germany    Berlin  82500000.0    Berlin  0.926

In [7]:
df1.merge(df2, on='country', how='left')

     country capital_x   inhabitant capital_y    HDI
0    Germany    Berlin   82500000.0    Berlin  0.926
1     France     Paris   66900000.0       NaN    NaN
2  Indonesia   Jakarta  255500000.0       NaN    NaN

In [8]:
df1.merge(df2, on='country', how='right')

   country capital_x  inhabitant capital_y    HDI
0  Germany    Berlin  82500000.0    Berlin  0.926
1    Italy       NaN         NaN      Rome  0.897
2    Spain       NaN         NaN    Madrid  0.844
3  Austria       NaN         NaN    Vienna  0.893

In [9]:
df1.merge(df2,left_on='country', right_on='country',how='outer')

     country capital_x   inhabitant capital_y    HDI
0    Germany    Berlin   82500000.0    Berlin  0.926
1     France     Paris   66900000.0       NaN    NaN
2  Indonesia   Jakarta  255500000.0       NaN    NaN
3      Italy       NaN          NaN      Rome  0.897
4      Spain       NaN          NaN    Madrid  0.844
5    Austria       NaN          NaN    Vienna  0.893